bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90CAN32.xml
            <module name="JTAG">
                <instance name="JTAG" caption="JTAG Interface">
                    <register-group name="JTAG" name-in-module="JTAG" offset="0x00" address-space="data" caption="JTAG Interface"/>
                    <signals>
                        <signal group="TCK" function="default" pad="PF4"/>
                        <signal group="TMS" function="default" pad="PF5"/>
                        <signal group="TDO" function="default" pad="PF6"/>
                        <signal group="TDI" function="default" pad="PF7"/>
                    </signals>
                </instance>
            </module>
            <module name="SPI">
                <instance name="SPI" caption="Serial Peripheral Interface">
                    <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
                    <signals>
                        <signal group="SS" function="default" pad="PB0"/>
                        <signal group="MOSI" function="default" pad="PB2"/>
                        <signal group="MISO" function="default" pad="PB3"/>
                        <signal group="SCK" function="default" pad="PB1"/>
                    </signals>
                </instance>
            </module>
            <module name="TWI">
                <instance name="TWI" caption="Two Wire Serial Interface">
                    <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data" caption="Two Wire Serial Interface"/>
                    <signals>
                        <signal group="SDA" function="default" pad="PD1"/>
                        <signal group="SCL" function="default" pad="PD0"/>
                    </signals>
                </instance>
            </module>
            <module name="USART">
                <instance name="USART0" caption="USART">
                    <register-group name="USART0" name-in-module="USART0" offset="0x00" address-space="data" caption="USART"/>
                    <signals>
                        <signal group="TXD" function="default" pad="PE1"/>
                        <signal group="RXD" function="default" pad="PE0"/>
                        <signal group="XCK" function="default" pad="PE2"/>
                    </signals>
                </instance>
                <instance name="USART1" caption="USART">
                    <register-group name="USART1" name-in-module="USART1" offset="0x00" address-space="data" caption="USART"/>
                    <signals>
                        <signal group="TXD" function="default" pad="PD3"/>
                        <signal group="RXD" function="default" pad="PD2"/>
                        <signal group="XCK" function="default" pad="PD5"/>
                    </signals>
                </instance>
            </module>
            <module name="CPU">
                <instance name="CPU" caption="CPU Registers">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data" caption="CPU Registers"/>
                    <signals>
                        <signal group="CLKO" index="0" function="default" pad="PC7"/>
                    </signals>
                    <parameters>
                        <param name="CORE_VERSION" value="V2E"/>
                    </parameters>
                </instance>
            </module>
            <module name="BOOT_LOAD">
                <instance name="BOOT_LOAD" caption="Bootloader">
                    <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data" caption="Bootloader"/>
                </instance>
            </module>
            <module name="EXINT">
                <instance name="EXINT" caption="External Interrupts">
                    <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
                    <signals>
                        <signal group="INT" index="0" function="default" pad="PD0"/>
                        <signal group="INT" index="1" function="default" pad="PD1"/>
                        <signal group="INT" index="2" function="default" pad="PD2"/>
                        <signal group="INT" index="3" function="default" pad="PD3"/>
                        <signal group="INT" index="4" function="default" pad="PE4"/>
                        <signal group="INT" index="5" function="default" pad="PE5"/>
                        <signal group="INT" index="6" function="default" pad="PE6"/>
                        <signal group="INT" index="7" function="default" pad="PE7"/>
                    </signals>
                </instance>
            </module>
            <module name="EEPROM">
                <instance name="EEPROM" caption="EEPROM">
                    <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
                </instance>
            </module>
            <module name="TC8">
                <instance name="TC0" caption="Timer/Counter, 8-bit">
                    <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
                    <signals>
                        <signal group="T" function="default" pad="PD7"/>
                        <signal group="OCA" function="default" pad="PB7"/>
                    </signals>
                </instance>
            </module>
            <module name="TC16">
                <instance name="TC1" caption="Timer/Counter, 16-bit">
                    <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
                    <signals>
                        <signal group="T" function="default" pad="PD6"/>
                        <signal group="ICP" function="default" pad="PD4"/>
                        <signal group="OCA" function="default" pad="PB5"/>
                        <signal group="OCB" function="default" pad="PB6"/>
                        <signal group="OCC" function="default" pad="PB7"/>
                    </signals>
                </instance>
                <instance name="TC3" caption="Timer/Counter, 16-bit">
                    <register-group name="TC3" name-in-module="TC3" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
                    <signals>
                        <signal group="T" function="default" pad="PE6"/>
                        <signal group="ICP" function="default" pad="PE7"/>
                        <signal group="OCA" function="default" pad="PE3"/>
                        <signal group="OCB" function="default" pad="PE4"/>
                        <signal group="OCC" function="default" pad="PE5"/>
                    </signals>
                </instance>
            </module>
