bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90CAN32.xml
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
                    <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="ICIE1"/>
                    <bitfield caption="Timer/Counter1 Output CompareC Match Interrupt Enable" mask="0x08" name="OCIE1C"/>
                    <bitfield caption="Timer/Counter1 Output CompareB Match Interrupt Enable" mask="0x04" name="OCIE1B"/>
                    <bitfield caption="Timer/Counter1 Output CompareA Match Interrupt Enable" mask="0x02" name="OCIE1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag register" name="TIFR1" offset="0x36" size="1" ocd-rw="R">
                    <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
                    <bitfield caption="Output Compare Flag 1C" mask="0x08" name="OCF1C"/>
                    <bitfield caption="Output Compare Flag 1B" mask="0x04" name="OCF1B"/>
                    <bitfield caption="Output Compare Flag 1A" mask="0x02" name="OCF1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
                </register>
            </register-group>
            <register-group caption="Timer/Counter, 16-bit" name="TC3">
                <register caption="Timer/Counter3 Control Register A" name="TCCR3A" offset="0x90" size="1">
                    <bitfield caption="Compare Output Mode 3A, bits" mask="0xC0" name="COM3A"/>
                    <bitfield caption="Compare Output Mode 3B, bits" mask="0x30" name="COM3B"/>
                    <bitfield caption="Compare Output Mode 3C, bits" mask="0x0C" name="COM3C"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM3"/>
                </register>
                <register caption="Timer/Counter3 Control Register B" name="TCCR3B" offset="0x91" size="1">
                    <bitfield caption="Input Capture 3 Noise Canceler" mask="0x80" name="ICNC3"/>
                    <bitfield caption="Input Capture 3 Edge Select" mask="0x40" name="ICES3"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM3" lsb="2"/>
                    <bitfield caption="Prescaler source of Timer/Counter 3" mask="0x07" name="CS3" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter 3 Control Register C" name="TCCR3C" offset="0x92" size="1">
                    <bitfield caption="Force Output Compare 3A" mask="0x80" name="FOC3A"/>
                    <bitfield caption="Force Output Compare 3B" mask="0x40" name="FOC3B"/>
                    <bitfield caption="Force Output Compare 3C" mask="0x20" name="FOC3C"/>
                </register>
                <register caption="Timer/Counter3 Bytes" name="TCNT3" offset="0x94" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output Compare Register Bytes" name="OCR3A" offset="0x98" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output Compare Register Bytes" name="OCR3B" offset="0x9A" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output Compare Register Bytes" name="OCR3C" offset="0x9C" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Input Capture Register Bytes" name="ICR3" offset="0x96" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK3" offset="0x71" size="1">
                    <bitfield caption="Timer/Counter3 Input Capture Interrupt Enable" mask="0x20" name="ICIE3"/>
                    <bitfield caption="Timer/Counter3 Output CompareC Match Interrupt Enable" mask="0x08" name="OCIE3C"/>
                    <bitfield caption="Timer/Counter3 Output CompareB Match Interrupt Enable" mask="0x04" name="OCIE3B"/>
                    <bitfield caption="Timer/Counter3 Output CompareA Match Interrupt Enable" mask="0x02" name="OCIE3A"/>
                    <bitfield caption="Timer/Counter3 Overflow Interrupt Enable" mask="0x01" name="TOIE3"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag register" name="TIFR3" offset="0x38" size="1" ocd-rw="R">
                    <bitfield caption="Input Capture Flag 3" mask="0x20" name="ICF3"/>
                    <bitfield caption="Output Compare Flag 3C" mask="0x08" name="OCF3C"/>
                    <bitfield caption="Output Compare Flag 3B" mask="0x04" name="OCF3B"/>
                    <bitfield caption="Output Compare Flag 3A" mask="0x02" name="OCF3A"/>
                    <bitfield caption="Timer/Counter3 Overflow Flag" mask="0x01" name="TOV3"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit Async" name="TC8_ASYNC">
            <register-group caption="Timer/Counter, 8-bit Async" name="TC2">
                <register caption="Timer/Counter2 Control Register" name="TCCR2A" offset="0xB0" size="1">
                    <bitfield caption="Force Output Compare" mask="0x80" name="FOC2A"/>
                    <bitfield caption="Waveform Genration Mode" mask="0x40" name="WGM20" values="WAVEFORM_GEN_MODE"/>
                    <bitfield caption="Compare Output Mode bits" mask="0x30" name="COM2A"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM21"/>
                    <bitfield caption="Clock Select bits" mask="0x07" name="CS2" values="CLK_SEL_3BIT"/>
                </register>
                <register caption="Timer/Counter2" name="TCNT2" offset="0xB2" size="1" mask="0xFF"/>
                <register caption="Timer/Counter2 Output Compare Register" name="OCR2A" offset="0xB3" size="1" mask="0xFF"/>
                <register caption="Timer/Counter Interrupt Mask register" name="TIMSK2" offset="0x70" size="1">
                    <bitfield caption="Timer/Counter2 Output Compare Match Interrupt Enable" mask="0x02" name="OCIE2A"/>
                    <bitfield caption="Timer/Counter2 Overflow Interrupt Enable" mask="0x01" name="TOIE2"/>
                </register>
