bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90CAN32.xml
                <register caption="Timer/Counter Interrupt Flag Register" name="TIFR2" offset="0x37" size="1" ocd-rw="R">
                    <bitfield caption="Output Compare Flag 2" mask="0x02" name="OCF2A"/>
                    <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x01" name="TOV2"/>
                </register>
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Prescaler Reset Timer/Counter2" mask="0x02" name="PSR2"/>
                </register>
                <register caption="Asynchronous Status Register" name="ASSR" offset="0xB6" size="1">
                    <bitfield caption="Enable External Clock Interrupt" mask="0x10" name="EXCLK"/>
                    <bitfield caption="AS2: Asynchronous Timer/Counter2" mask="0x08" name="AS2"/>
                    <bitfield caption="TCN2UB: Timer/Counter2 Update Busy" mask="0x04" name="TCN2UB"/>
                    <bitfield caption="Output Compare Register2 Update Busy" mask="0x02" name="OCR2UB"/>
                    <bitfield caption="TCR2UB: Timer/Counter Control Register2 Update Busy" mask="0x01" name="TCR2UB"/>
                </register>
            </register-group>
            <value-group caption="" name="WAVEFORM_GEN_MODE">
                <value caption="Normal" name="VAL_0x00" value="0x00"/>
                <value caption="PWM, Phase Correct" name="VAL_0x02" value="0x02"/>
                <value caption="CTC" name="VAL_0x01" value="0x01"/>
                <value caption="Fast PWM" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CLK_SEL_3BIT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/32" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/64" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/128" name="VAL_0x05" value="0x05"/>
                <value caption="Running, CLK/256" name="VAL_0x06" value="0x06"/>
                <value caption="Running, CLK/1024" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x60" size="1">
                    <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                    <bitfield caption="Watch Dog Timer Prescaler bits" mask="0x07" name="WDP" values="WDOG_TIMER_PRESCALE_3BITS"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_3BITS">
                <value caption="Oscillator Cycles 16K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 2048K" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog-to-Digital Converter" name="ADC">
            <register-group caption="Analog-to-Digital Converter" name="ADC">
                <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
                    <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF2"/>
                    <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
                </register>
                <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x7A" size="1" ocd-rw="R">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
                </register>
                <register caption="ADC Data Register Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="ADC High Speed Mode" mask="0x80" name="ADHSM"/>
                    <bitfield caption="ADC Auto Trigger Sources" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER2"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR0" offset="0x7E" size="1">
                    <bitfield caption="ADC7 Digital input Disable" mask="0x80" name="ADC7D"/>
                    <bitfield caption="ADC6 Digital input Disable" mask="0x40" name="ADC6D"/>
                    <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
                    <bitfield caption="ADC4 Digital input Disable" mask="0x10" name="ADC4D"/>
                    <bitfield caption="ADC3 Digital input Disable" mask="0x08" name="ADC3D"/>
                    <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
                    <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
                    <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_V_REF2">
                <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
                <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
                <value caption="Reserved" name="VAL_0x02" value="0x02"/>
                <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03" value="0x03"/>
            </value-group>
