bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90CAN32.xml
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER2">
                <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
                <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
                <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
                <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
                <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
                <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
                <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
                <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
                </register>
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1" ocd-rw="R">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
                    <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Controller Area Network" name="CAN">
            <register-group caption="Controller Area Network" name="CAN">
                <register caption="CAN General Control Register" name="CANGCON" offset="0xD8" size="1">
                    <bitfield caption="Abort Request" mask="0x80" name="ABRQ"/>
                    <bitfield caption="Overload Frame Request" mask="0x40" name="OVRQ"/>
                    <bitfield caption="Time Trigger Communication" mask="0x20" name="TTC"/>
                    <bitfield caption="Synchronization of TTC" mask="0x10" name="SYNTTC"/>
                    <bitfield caption="Listening Mode" mask="0x08" name="LISTEN"/>
                    <bitfield caption="Test Mode" mask="0x04" name="TEST"/>
                    <bitfield caption="Enable / Standby" mask="0x02" name="ENASTB"/>
                    <bitfield caption="Software Reset Request" mask="0x01" name="SWRES"/>
                </register>
                <register caption="CAN General Status Register" name="CANGSTA" offset="0xD9" size="1" ocd-rw="R">
                    <bitfield caption="Overload Frame Flag" mask="0x40" name="OVRG"/>
                    <bitfield caption="Transmitter Busy" mask="0x10" name="TXBSY"/>
                    <bitfield caption="Receiver Busy" mask="0x08" name="RXBSY"/>
                    <bitfield caption="Enable Flag" mask="0x04" name="ENFG"/>
                    <bitfield caption="Bus Off Mode" mask="0x02" name="BOFF"/>
                    <bitfield caption="Error Passive Mode" mask="0x01" name="ERRP"/>
                </register>
                <register caption="CAN General Interrupt Register" name="CANGIT" offset="0xDA" size="1" ocd-rw="R">
                    <bitfield caption="General Interrupt Flag" mask="0x80" name="CANIT"/>
                    <bitfield caption="Bus Off Interrupt Flag" mask="0x40" name="BOFFIT"/>
                    <bitfield caption="Overrun CAN Timer" mask="0x20" name="OVRTIM"/>
                    <bitfield caption="Burst Receive Interrupt" mask="0x10" name="BXOK"/>
                    <bitfield caption="Stuff Error General" mask="0x08" name="SERG"/>
                    <bitfield caption="CRC Error General" mask="0x04" name="CERG"/>
                    <bitfield caption="Form Error General" mask="0x02" name="FERG"/>
                    <bitfield caption="Ackknowledgement Error General" mask="0x01" name="AERG"/>
                </register>
                <register caption="CAN General Interrupt Enable Register" name="CANGIE" offset="0xDB" size="1">
                    <bitfield caption="Enable all Interrupts" mask="0x80" name="ENIT"/>
                    <bitfield caption="Enable Bus Off INterrupt" mask="0x40" name="ENBOFF"/>
                    <bitfield caption="Enable Receive Interrupt" mask="0x20" name="ENRX"/>
                    <bitfield caption="Enable Transmitt Interrupt" mask="0x10" name="ENTX"/>
                    <bitfield caption="Enable MOb Error Interrupt" mask="0x08" name="ENERR"/>
                    <bitfield caption="Enable Burst Receive Interrupt" mask="0x04" name="ENBX"/>
                    <bitfield caption="Enable General Error Interrupt" mask="0x02" name="ENERG"/>
                    <bitfield caption="Enable CAN Timer Overrun Interrupt" mask="0x01" name="ENOVRT"/>
                </register>
