bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90CAN32.xml
                <register caption="Enable MOb Register" name="CANEN2" offset="0xDC" size="1" mask="0xFF" ocd-rw="R">
                    <bitfield caption="Enable MOb" mask="0xFF" name="ENMOB"/>
                </register>
                <register caption="Enable MOb Register" name="CANEN1" offset="0xDD" size="1" mask="0x7F" ocd-rw="R">
                    <bitfield caption="Enable MOb" mask="0x7F" name="ENMOB" lsb="8"/>
                </register>
                <register caption="Enable Interrupt MOb Register" name="CANIE2" offset="0xDE" size="1" mask="0xFF">
                    <bitfield caption="Interrupt Enable by MOb" mask="0xFF" name="IEMOB"/>
                </register>
                <register caption="Enable Interrupt MOb Register" name="CANIE1" offset="0xDF" size="1" mask="0x7F">
                    <bitfield caption="Interrupt Enable by MOb" mask="0x7F" name="IEMOB" lsb="8"/>
                </register>
                <register caption="CAN Status Interrupt MOb Register" name="CANSIT2" offset="0xE0" size="1" mask="0xFF" ocd-rw="R">
                    <bitfield caption="Status of Interrupt by MOb" mask="0xFF" name="SIT"/>
                </register>
                <register caption="CAN Status Interrupt MOb Register" name="CANSIT1" offset="0xE1" size="1" mask="0x7F" ocd-rw="R">
                    <bitfield caption="Status of Interrupt by MOb" mask="0x7F" name="SIT" lsb="8"/>
                </register>
                <register caption="Bit Timing Register 1" name="CANBT1" offset="0xE2" size="1">
                    <bitfield caption="Baud Rate Prescaler bits" mask="0x7E" name="BRP"/>
                </register>
                <register caption="Bit Timing Register 2" name="CANBT2" offset="0xE3" size="1">
                    <bitfield caption="Re-Sync Jump Width" mask="0x60" name="SJW"/>
                    <bitfield caption="Propagation Time Segment" mask="0x0E" name="PRS"/>
                </register>
                <register caption="Bit Timing Register 3" name="CANBT3" offset="0xE4" size="1">
                    <bitfield caption="Phase Segments" mask="0x70" name="PHS2"/>
                    <bitfield caption="Phase Segment 1" mask="0x0E" name="PHS1"/>
                    <bitfield caption="Sample Type" mask="0x01" name="SMP"/>
                </register>
                <register caption="Timer Control Register" name="CANTCON" offset="0xE5" size="1" mask="0xFF">
                    <bitfield caption="CAN Timer Prescaler" mask="0xFF" name="TPRSC"/>
                </register>
                <register caption="Timer Register" name="CANTIM" offset="0xE6" size="2" ocd-rw="R">
                    <bitfield caption="CAN Timer Count" mask="0xFFFF" name="CANTIM"/>
                </register>
                <register caption="TTC Timer Register" name="CANTTC" offset="0xE8" size="2" ocd-rw="R">
                    <bitfield caption="TTC Timer Count" mask="0xFFFF" name="TIMTTC"/>
                </register>
                <register caption="Transmit Error Counter Register" name="CANTEC" offset="0xEA" size="1" mask="0xFF" ocd-rw="R">
                    <bitfield caption="Trasnmit Error Count" mask="0xFF" name="TEC"/>
                </register>
                <register caption="Receive Error Counter Register" name="CANREC" offset="0xEB" size="1" mask="0xFF" ocd-rw="R">
                    <bitfield caption="Receive Error Count" mask="0xFF" name="REC"/>
                </register>
                <register caption="Highest Priority MOb Register" name="CANHPMOB" offset="0xEC" size="1">
                    <bitfield caption="Highest Priority MOb number" mask="0xF0" name="HPMOB"/>
                    <bitfield caption="CAN General purpose bits" mask="0x0F" name="CGP" rw="R"/>
                </register>
                <register caption="Page MOb Register" name="CANPAGE" offset="0xED" size="1">
                    <bitfield caption="MOb Number Bits" mask="0xF0" name="MOBNB"/>
                    <bitfield caption="MOb Data Buffer Auto Increment" mask="0x08" name="AINC"/>
                    <bitfield caption="Data Buffer Index Bits" mask="0x07" name="INDX"/>
                </register>
                <register caption="MOb Status Register" name="CANSTMOB" offset="0xEE" size="1">
                    <bitfield caption="Data Length Code Warning" mask="0x80" name="DLCW"/>
                    <bitfield caption="Transmit OK" mask="0x40" name="TXOK"/>
                    <bitfield caption="Receive OK" mask="0x20" name="RXOK"/>
                    <bitfield caption="Bit Error" mask="0x10" name="BERR"/>
                    <bitfield caption="Stuff Error" mask="0x08" name="SERR"/>
                    <bitfield caption="CRC Error" mask="0x04" name="CERR"/>
                    <bitfield caption="Form Error" mask="0x02" name="FERR"/>
                    <bitfield caption="Ackknowledgement Error" mask="0x01" name="AERR"/>
                </register>
                <register caption="MOb Control and DLC Register" name="CANCDMOB" offset="0xEF" size="1">
                    <bitfield caption="MOb Config Bits" mask="0xC0" name="CONMOB"/>
                    <bitfield caption="Reply Valid" mask="0x20" name="RPLV"/>
                    <bitfield caption="Identifier Extension" mask="0x10" name="IDE"/>
                    <bitfield caption="Data Length Code Bits" mask="0x0F" name="DLC"/>
                </register>
                <register caption="Identifier Tag Register 4" name="CANIDT4" offset="0xF0" size="1" mask="0xFF">
                    <bitfield caption="Identifier Tag" mask="0xF8" name="IDT"/>
                    <bitfield caption="Remote Trasnmission Request Tag" mask="0x04" name="RTRTAG"/>
                    <bitfield caption="Reserved Bit 1 Tag" mask="0x02" name="RB1TAG"/>
                    <bitfield caption="Reserved Bit 0 Tag" mask="0x01" name="RB0TAG"/>
                </register>
                <register caption="Identifier Tag Register 3" name="CANIDT3" offset="0xF1" size="1" mask="0xFF">
                    <bitfield caption="Identifier Tag" mask="0xFF" name="IDT" lsb="5"/>
                </register>
                <register caption="Identifier Tag Register 2" name="CANIDT2" offset="0xF2" size="1" mask="0xFF">
                    <bitfield caption="Identifier Tag" mask="0xFF" name="IDT" lsb="13"/>
                </register>
                <register caption="Identifier Tag Register 1" name="CANIDT1" offset="0xF3" size="1" mask="0xFF">
                    <bitfield caption="Identifier Tag" mask="0xFF" name="IDT" lsb="21"/>
                </register>
                <register caption="Identifier Mask Register 4" name="CANIDM4" offset="0xF4" size="1">
                    <bitfield caption="Identifier Mask" mask="0xF8" name="IDMSK"/>
                    <bitfield caption="Remote Transmission Request Mask" mask="0x04" name="RTRMSK"/>
                    <bitfield caption="Identifier Extension Mask" mask="0x01" name="IDEMSK"/>
                </register>
                <register caption="Identifier Mask Register 3" name="CANIDM3" offset="0xF5" size="1">
                    <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="5"/>
                </register>
                <register caption="Identifier Mask Register 2" name="CANIDM2" offset="0xF6" size="1">
                    <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="13"/>
                </register>
