bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90CAN32.xml
                <register caption="Identifier Mask Register 1" name="CANIDM1" offset="0xF7" size="1">
                    <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="21"/>
                </register>
                <register caption="Time Stamp Register" name="CANSTM" offset="0xF8" size="2" mask="0xFFFF" ocd-rw="R">
                    <bitfield caption="Time Stamp Count" mask="0xFFFF" name="TIMSTM"/>
                </register>
                <register caption="Message Data Register" name="CANMSG" offset="0xFA" size="1" mask="0xFF">
                    <bitfield caption="Message Data" mask="0xFF" name="MSG"/>
                </register>
            </register-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="TQFP64" caption="TQFP64">
            <pin position="1" pad="NC"/>
            <pin position="2" pad="PE0"/>
            <pin position="3" pad="PE1"/>
            <pin position="4" pad="PE2"/>
            <pin position="5" pad="PE3"/>
            <pin position="6" pad="PE4"/>
            <pin position="7" pad="PE5"/>
            <pin position="8" pad="PE6"/>
            <pin position="9" pad="PE7"/>
            <pin position="10" pad="PB0"/>
            <pin position="11" pad="PB1"/>
            <pin position="12" pad="PB2"/>
            <pin position="13" pad="PB3"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="PB5"/>
            <pin position="16" pad="PB6"/>
            <pin position="17" pad="PB7"/>
            <pin position="18" pad="PG3"/>
            <pin position="19" pad="PG4"/>
            <pin position="20" pad="RESET"/>
            <pin position="21" pad="VCC"/>
            <pin position="22" pad="GND"/>
            <pin position="23" pad="XTAL2"/>
            <pin position="24" pad="XTAL1"/>
            <pin position="25" pad="PD0"/>
            <pin position="26" pad="PD1"/>
            <pin position="27" pad="PD2"/>
            <pin position="28" pad="PD3"/>
            <pin position="29" pad="PD4"/>
            <pin position="30" pad="PD5"/>
            <pin position="31" pad="PD6"/>
            <pin position="32" pad="PD7"/>
            <pin position="33" pad="PG0"/>
            <pin position="34" pad="PG1"/>
            <pin position="35" pad="PC0"/>
            <pin position="36" pad="PC1"/>
            <pin position="37" pad="PC2"/>
            <pin position="38" pad="PC3"/>
            <pin position="39" pad="PC4"/>
            <pin position="40" pad="PC5"/>
            <pin position="41" pad="PC6"/>
            <pin position="42" pad="PC7"/>
            <pin position="43" pad="PG2"/>
            <pin position="44" pad="PA7"/>
            <pin position="45" pad="PA6"/>
            <pin position="46" pad="PA5"/>
            <pin position="47" pad="PA4"/>
            <pin position="48" pad="PA3"/>
            <pin position="49" pad="PA2"/>
            <pin position="50" pad="PA1"/>
            <pin position="51" pad="PA0"/>
            <pin position="52" pad="VCC"/>
            <pin position="53" pad="GND"/>
            <pin position="54" pad="PF7"/>
            <pin position="55" pad="PF6"/>
            <pin position="56" pad="PF5"/>
            <pin position="57" pad="PF4"/>
            <pin position="58" pad="PF3"/>
            <pin position="59" pad="PF2"/>
            <pin position="60" pad="PF1"/>
            <pin position="61" pad="PF0"/>
            <pin position="62" pad="AREF"/>
            <pin position="63" pad="GND"/>
            <pin position="64" pad="AVCC"/>
        </pinout>
        <pinout name="QFN64" caption="QFN64">
            <pin position="1" pad="NC"/>
            <pin position="2" pad="PE0"/>
            <pin position="3" pad="PE1"/>
            <pin position="4" pad="PE2"/>
            <pin position="5" pad="PE3"/>
            <pin position="6" pad="PE4"/>
            <pin position="7" pad="PE5"/>
            <pin position="8" pad="PE6"/>
            <pin position="9" pad="PE7"/>
            <pin position="10" pad="PB0"/>
            <pin position="11" pad="PB1"/>
            <pin position="12" pad="PB2"/>
            <pin position="13" pad="PB3"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="PB5"/>
            <pin position="16" pad="PB6"/>
            <pin position="17" pad="PB7"/>
            <pin position="18" pad="PG3"/>
            <pin position="19" pad="PG4"/>
            <pin position="20" pad="RESET"/>
            <pin position="21" pad="VCC"/>
            <pin position="22" pad="GND"/>
            <pin position="23" pad="XTAL2"/>
            <pin position="24" pad="XTAL1"/>
            <pin position="25" pad="PD0"/>
            <pin position="26" pad="PD1"/>
            <pin position="27" pad="PD2"/>
            <pin position="28" pad="PD3"/>
            <pin position="29" pad="PD4"/>
            <pin position="30" pad="PD5"/>
            <pin position="31" pad="PD6"/>
            <pin position="32" pad="PD7"/>
            <pin position="33" pad="PG0"/>
            <pin position="34" pad="PG1"/>
            <pin position="35" pad="PC0"/>
            <pin position="36" pad="PC1"/>
            <pin position="37" pad="PC2"/>
            <pin position="38" pad="PC3"/>
            <pin position="39" pad="PC4"/>
            <pin position="40" pad="PC5"/>
            <pin position="41" pad="PC6"/>
            <pin position="42" pad="PC7"/>
            <pin position="43" pad="PG2"/>
            <pin position="44" pad="PA7"/>
            <pin position="45" pad="PA6"/>
            <pin position="46" pad="PA5"/>
            <pin position="47" pad="PA4"/>
            <pin position="48" pad="PA3"/>
            <pin position="49" pad="PA2"/>
            <pin position="50" pad="PA1"/>
            <pin position="51" pad="PA0"/>
            <pin position="52" pad="VCC"/>
            <pin position="53" pad="GND"/>
            <pin position="54" pad="PF7"/>
            <pin position="55" pad="PF6"/>
            <pin position="56" pad="PF5"/>
            <pin position="57" pad="PF4"/>
            <pin position="58" pad="PF3"/>
            <pin position="59" pad="PF2"/>
            <pin position="60" pad="PF1"/>
            <pin position="61" pad="PF0"/>
            <pin position="62" pad="AREF"/>
            <pin position="63" pad="GND"/>
            <pin position="64" pad="AVCC"/>
        </pinout>
    </pinouts>
</target-description-file>
